The calculation could not be performed. Verify the pump curve data.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId NetworkErrorExtractCurveData { get; }
  Visual Basic
Public Shared ReadOnly Property NetworkErrorExtractCurveData As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ NetworkErrorExtractCurveData {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPCalculationFailures Class
  Autodesk.Revit.DB Namespace